{
  "architectures": [
    "ResnetModelForImageClassification"
  ],
  "auto_map": {
    "AutoConfig": "configuration_resnet.ResnetConfig",
    "AutoModelForImageClassification": "modeling_resnet.ResnetModelForImageClassification"
  },
  "avg_down": true,
  "base_width": 64,
  "block_type": "bottleneck",
  "cardinality": 1,
  "input_channels": 3,
  "layers": [
    3,
    4,
    6,
    3
  ],
  "model_type": "faen_resnet",
  "num_classes": 1000,
  "stem_type": "deep",
  "stem_width": 32,
  "torch_dtype": "float32",
  "transformers_version": "4.37.2"
}
